Autodesk.Revit.UI.UIControlledApplication.#ctor(Autodesk.Revit.ApplicationServices.Application)
Use a database level Application to construct a UI-level Application.

Autodesk.Revit.UI.UIControlledApplication.RegisterDockablePane(Autodesk.Revit.UI.DockablePaneId,System.String,Autodesk.Revit.UI.IDockablePaneProvider)
Adds a new dockable pane to the Revit user interface.
id: Unique identifier for the new pane.
title: String to use for the pane caption.
provider: Your add-in's implementation of the IDockablePaneProvider interface.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if a dockable pane with identifier %id% has already been registered.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if DockPosition is Floating but no FloatingRectangle has been provided, or the FloatingRectangle is not larger than 3x3.
Since: 2014

Autodesk.Revit.UI.UIControlledApplication.LoadPackageContents(System.String)
Loads add-ins from the given packageContents.xml file.
packageContentsPath: The name of package contents file

Autodesk.Revit.UI.UIControlledApplication.LoadAddIn(System.String)
Loads add-ins from the given manifest file.
Remarks:
This method loads the add-ins listed in the provided add-in manifest file.
The API will look for the file in the dedicated folders supported by Revit for loading add-in manifest files.
Some add-ins may have settings in which they decline the ability for Revit to load the external application declared
in the .addin in mid-session.
This happens when the AllowLoadIntoExistingSession tag is set to false in the add-in manifest file, and if the tag
isn't present, the default is set to "True".
Note that when Revit starts an add-in in the middle of the session, some add-in logic may not function as expected
because of the different interactions with the session.  Specifically:
If the application's goal is to prevent something from happening, the application may not be able to handle
the fact that this activity has already happened in the existing session. If the application's goal is to manage external information in synch with documents loaded in the session,
the application may not be able to handle documents that were loaded before the application started. If the application's logic depends on the ApplicationInitialized event, this event has already been called
before the add-in was loaded.
Also, some add-ins may not be able to fully initialize when loading in the middle of the session.  This is because some
activities must take place at the start of the Revit session:
Creation of custom failure definitionsEstablishment of a system-wide IFailureProcessor to handle all failures.Registering ExternalServices.
fileName: The name of the add-in manifest file including the extension is to identify the
manifest file which contains Revit add-ins.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException: Thrown when manifest file which is specified by
fileName doesn't exist.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown if the fileName is null or empty.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the fileName doesn't end with 'addin'.
Throws Autodesk.Revit.Exceptions.ApplicationException: Thrown if the manifest file can't be parsed successfully.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when any of the newly added external
applications fails to load and/or initialize properly, possibly because of one of the following reasons:
AllowLoadIntoExistingSession property is 'No'.Client id is duplicated.External application start up failed.
Since: 2014

Autodesk.Revit.UI.UIControlledApplication.CreateRibbonTab(System.String)
Creates a new tab on the Revit user interface.
tabName: The name of the tab to be created.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: tabName or panelName is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: tabName or panelName is Empty or the tab name duplicates the name of another tab in the Revit UI.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Too many custom tabs have been created in this session. (Maximum is 20).
Remarks:  This method will create a custom tab at the end of the list of static tabs. If multiple tabs are added, they will be shown in the order added. This method is not supported in Macros.

Autodesk.Revit.UI.UIControlledApplication.DialogBoxShowing
Subscribe to the DialogBoxShowing event to be notified when Revit is just about to show a dialog box or a message box.
Remarks:
This event is raised when Revit is just about to show a dialog box or a message box.
Event is not cancellable. The 'Cancellable' property of event’s argument is always False.
Depending on the type of the dialog that is being shown, the event's argument's type varies as follows:
When it is a dialog box, the event’s argument is an object of Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs.
When it is a message box, the event’s argument is an object of Autodesk.Revit.UI.Events.MessageBoxShowingEventArgs,which is subclass of DialogBoxShowingEventArgs.
When it is a task dialog, the event’s argument is an object of Autodesk.Revit.UI.Events.TaskDialogShowingEventArgs,which is subclass of DialogBoxShowingEventArgs.
No document may be modified during this event.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save and similar overloads.Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.

Autodesk.Revit.UI.UIControlledApplication.ApplicationClosing
Subscribe to the ApplicationClosing event to be notified when the Revit application is just about to be closed.
Remarks:
This event is raised when the Revit application is just about to be closed.
Event is not cancellable. The 'Cancellable' property of event’s argument is always False.
No document may be modified at the time of the event.
The sender object of this event is Autodesk.Revit.UI.UIControlledApplication object.

Autodesk.Revit.UI.UIControlledApplication.ViewActivated
Subscribe to the ViewActivated event to be notified immediately after Revit has finished activating a view of a document.
Remarks:
This event is raised immediately after Revit has finished activating a view of the document.
It is raised even when view activating failed or was cancelled (during ViewActivating event).
Check the 'Status' field in event’s argument to see whether the action itself was successful or not.
This event is not cancellable, for the process of view activating has already been finished.
The document may be modified during this event.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save and similar overloads.Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.

Autodesk.Revit.UI.UIControlledApplication.ViewActivating
Subscribe to the ViewActivating event to be notified when Revit is just about to activate a view of a document.
Remarks:
This event is raised when Revit is just about to activate a view of the document.
Event is not cancellable. The 'Cancellable' property of event’s argument is always False.
Your application is responsible for providing feedback to the user about the reason for the cancellation.
The document may be modified during this event.
The following API functions are not available for the current document during this event:
Autodesk.Revit.DB.Document.Close and similar overloads.Autodesk.Revit.DB.Document.Save and similar overloads.Autodesk.Revit.DB.Document.SaveAs(System.String) and similar overloads.
Exception Autodesk.Revit.Exceptions.InvalidOperationException will be thrown if any of the above methods is called during this event.
Another Autodesk.Revit.UI.UIApplication.ViewActivated event will be raised immediately after view activating
is finished.

Autodesk.Revit.UI.UIControlledApplication.DoDragDrop(System.Object,Autodesk.Revit.UI.IDropHandler)
Initiates a drag and drop operation with a custom drop implementation.
dropData: Any arbitrary data to be passed to the drop handler when the drop occurs.
handler: The handler to be executed when the drop occurs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when dropData or handler is null.
Since:
2013

Autodesk.Revit.UI.UIControlledApplication.OpenAndActivateDocument(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.OpenOptions,System.Boolean)
Opens and activates a Revit document.
Remarks:
This method, if successful, changes the active document.
It is not allowed to have an open transaction in the active document when calling this method.
Consequently, this method can only be used in manual transaction mode, not in automatic mode.
Additionally, this method may not be called from inside an event handler.
modelPath:
A path to a revit file to be opened.
The file can be either a Revit project, template, or family document.
openOptions: Options for opening the file.
bDetachAndPrompt: True means if openOptions specifies DoNotDetach,
then for workshared models detach from central and query the user whether to preserve or discard worksets.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
If null is passed as 'modelPath'.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
If null is passed as 'openOptions'.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The file specified by 'modelPath' cannot be found or the given 'modelPath' is not a Revit file (a project, template, or family document).
Throws Autodesk.Revit.Exceptions.ArgumentException: If the modelPath is not a Autodesk.Revit.DB.FilePath
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If the active document is currently modifiable.
If an API event handler is currently being executed.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException: If there is any network communication error.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:  If the model is being accessed by other users.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException: If there is any server internal error.
Since:
2013

Autodesk.Revit.UI.UIControlledApplication.OpenAndActivateDocument(System.String)
Opens and activates a Revit document.
Remarks:
This method, if successful, changes the active document.
It is not allowed to have an open transaction in the active document when calling this method.
Consequently, this method can only be used in manual transaction mode, not in automatic mode.
Additionally, this method may not be called from inside an event handler.
fileName:
A full path to a revit file to be opened.
The file can be either a Revit project, template, or family document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
If null is passed as 'fileName'.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The file specified by 'fileName' cannot be found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given 'fileName' is not a Revit file (a project, template, or family document).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
If the active document is currently modifiable.
If an API event handler is currently being executed.
Since:
2012

Autodesk.Revit.UI.UIControlledApplication.DrawingAreaExtents
Get the rectangle that represents the screen pixel coordinates of drawing area.
Remarks: The drawing area of the Revit window displays views (and sheets and schedules) of the current project.
The size of drawing area restricts the max size of the view windows.
If there is no project opened, null will be returned.
Since: 2011

Autodesk.Revit.UI.UIControlledApplication.MainWindowExtents
Get the rectangle that represents the screen pixel coordinates of Revit main window.
Since: 2011

Autodesk.Revit.UI.UIControlledApplication.#ctor(Autodesk.Revit.ApplicationServices.ControlledApplication)
Use a database level Application to construct a UI-level Application.